performance_tests/artillery/sse.yml
  config:
    target: "http://localhost:4000/_rig/v1/connection/sse"
    processor: "./utils.js"
    phases:
      - duration: 300
        arrivalRate: 25
  scenarios:
    - name: "Connect to SSE"
      flow:
        - function: "connectToSSE"
        # keep connection open for 15s
        - think: 15